function [  ] = table_draw( x, y, z)
    %table_trig_expres Строит таблицу с аргументами x и результатами y 
    %   Аргументы:
    %       x - Вектор. Ввод значений аргумента
    %       y - Вектор. Ввод значений функции
    %       z - Вектор. Ввод значений интеграла
    %   Вывод:
    %       Таблица Аргумент-Функция-интеграл
    fprintf('/-----------------------------------------------\\\n');
    fprintf('|    Аргумент   |    Функция    |   Интеграл    |\n');
    fprintf('|---------------|---------------|---------------|\n');

    for i = 1:length(x)
       fprintf('|%15.4f|%15.4f|%15.4f|\n', x(i), y(i), z(i));
    end

    fprintf('\\-----------------------------------------------/\n');
end

