function [ y ] = f1( x )
%f1 Вычисление значения кусочно-заданной функции
%   x - входной аргумент от -2 до 3 включительно, скаляр
%   y - выходное значение функции, скаляр
        if (x<-2)|(x>3)
            error('Аргумент должен быть в диапазоне от -2 до 3')
        end
        dx = 0.0005; % Шаг интегрирования
        e = 0.0001;  % Минимальный член суммы рядов
        if x < 0
            % x < 0 
            y = -1;

        elseif x <=1
            % x < 1
            Y = 0;
            for c = 0:dx:x-dx % Численное интегрирование для текущего аргумента
                Y = Y+exp(-(c-3)^2)+c; % Высчитывание значений для поиска интеграла
            end
            y = Y*dx; % Высчитываение площади трапеции(интеграла)

        else
            % x >= 1 
            sum_element = x-2.2; % Нулевой элемент суммы
            sum = sum_element; % Начальная сумма
            N = 0; % Счётчик итераций
            while abs(sum_element) >= e % Проверка меньше ли следующий элемент, чем e 
                N = N + 1; % Счётчик
                q = (2.2-x)./(N+1); % множитель суммы рядов
                sum_element = sum_element .* q; % Элемент суммы
                sum = sum + sum_element; % Сумма
            end   
            y = sum;
        end


