% Лабораторная работа №2 Программирование в системе MATLAB
% Рисование графика кусочно-заданной функции; drawing_func.m
i = 0;       % Обнуление счётчика
dx = 0.0005; % Шаг интегрирования
e = 0.0001;  % Минимальный член суммы рядов
for x = -2:0.002:3 % Перебор каждого аргумента функции
        i = i + 1; % Счётчик
    if x < 0
        % x < 0 
        y(i) = -1;
    elseif x <=1
        % x < 1
        Y = 0;
        for z = 0:dx:x-dx % Численное интегрирование для текущего аргумента
            Y = Y+exp(-(z-3)^2)+z; % Высчитывание значений для поиска интеграла
        end
        y(i)=Y*dx; % Высчитываение площади трапеции(интеграла)
    else
        % x >= 1 
        sum_element = x-2.2; % Нулевой элемент суммы
        sum = sum_element; % Начальная сумма
        N = 0; % Счётчик итераций
        while abs(sum_element) >= e % Проверка меньше ли следующий элемент, чем e 
            N = N + 1; % Счётчик
            q = (2.2-x)./(N+1); % множитель суммы рядов
            sum_element = sum_element .* q; % Элемент суммы
            sum = sum + sum_element; % Сумма
        end   
        y(i) = sum;
    end
end
x = -2:0.002:3; % Задание отрезка для графика функции
plot(x,y) % Отрисовка графика и подпись осей
xlabel x
ylabel y
