% Лабораторная работа №2 Программирование в системе MATLAB
% Рисование графика кусочно-заданной функции; drawing_func.m
i = 0;       % Обнуление счётчика
dx = 0.0005; % Шаг интегрирования
e = 0.0001;  % Минимальный член суммы рядов
for x = -2:0.002:3 % Перебор каждого аргумента функции
        i = i + 1; % Счётчик
    if x < 0
        % x < 0 
        y(i) = -1;
    elseif x <=1
        % x < 1
        Y = 0;
        for z = 0:dx:x % Численное интегрирование для текущего аргумента
            Y = Y+exp(-(z-3)^2)+z; % Высчитывание значений для поиска интеграла
        end
        y(i)=Y*dx; % Высчитываение площади трапеции(интеграла)
    else
        % x >= 1 
        sum_element = x-2.2; % Задание некого большого числа для цикла
        sum = sum_element; % Обнуление суммы
        fact = 1; % Переменная для поиска факториала
        N = 0; % Счётчик итераций
        while abs(sum_element) >= e % Проверка меньше ли следующий элемент, чем e 
            N = N + 1; % Счётчик
            fact = fact .* N .* (N+1); % Факториал следующего числа
            sum_element = ((-1).^N .*(x-2.2).^(N+1))/fact; % Элемент суммы
            sum = sum + sum_element; % Сумма
            fact = fact ./ (N+1); 
        end   
        y(i) = sum;
    end
end
x = -2:0.002:3; % Задание отрезка для графика функции
plot(x,y) % Отрисовка графика и подпись осей
xlabel x
ylabel y
