% Лабораторная работа №2 Программирование в системе MATLAB
% Рисование графика кусочно-заданной функции; trapezoid_method.m
% Метод трапеции
i = 0;       % Обнуление счётчика
dx = 0.0005; % Шаг интегрирования
e = 0.0001;  % Минимальный член суммы рядов
for x = -2:0.002:3 % Перебор каждого аргумента функции
        i = i + 1; % Счётчик
    if x < 0
        % x < 0 
        y(i) = -1;
    elseif x <=1
        % x < 1
        y(i) = 0.5*((exp(-(0-3)^2)+0)+(exp(-(x-3)^2)+x));
        z = 0;
        while z<=x-dx
            y(i) = y(i)+(exp(-(z-3)^2)+z);
            z = z+dx;
        end
        y(i) = y(i)*dx;
    else
        % x >= 1 
        sum_element = x-2.2; % Нулевой элемент суммы
        sum = sum_element; % Начальная сумма
        N = 0; % Счётчик итераций
        while abs(sum_element) >= e % Проверка меньше ли следующий элемент, чем e 
            N = N + 1; % Счётчик
            q = (2.2-x)./(N+1); % множитель суммы рядов
            sum_element = sum_element .* q; % Элемент суммы
            sum = sum + sum_element; % Сумма
        end   
        y(i) = sum;
    end
end
x = -2:0.002:3; % Задание отрезка для графика функции
plot(x,y) % Отрисовка графика и подпись осей
xlabel x
ylabel y