function [ num1, num2 ] = f2()
    %f2 Проверяет, отрицально ли число 1 и больше ли 2го
    %   Аргументы:
    %       -
    %   Вывод:
    %       num1 - Число. Вывод введённого числа, если оно удовлетворяет
    %       условию.
    %       num2 - Число. Вывод введённого числа, если оно удовлетворяет
    %       условию.
    num1 = negative_number('Введите первое число ');
    num2 = negative_number('Введите второе число ');
    if num1 <= num2
        disp('Ошибка!')
        disp('Введите число меньше первого!')
        num2 = negative_number('Введите второе число ');
        return
    end
end

