function [  ] = table_draw( x, y )
    %table_trig_expres Строит таблицу с аргументами x и результатами y 
    %   Аргументы:
    %       x - Вектор. Ввод значений аргумента
    %       y - Вектор. Ввод значений функции
    %   Вывод:
    %       Таблица Аргумент-Функция
    fprintf('/-------------------------------\\\n');
    fprintf('|    Аргумент   |    Функция    |\n');
    fprintf('|---------------|---------------|\n');

    for i = 1:length(x)
       fprintf('|%15.4f|%15.4f|\n', x(i), y(i));
    end

    fprintf('\\-------------------------------/\n');
end

